# Velocity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..Velocity Property
MEPSection Class See Also
---
The velocity of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Velocity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Velocity As Double
	Get
```

Visual C++
---
```text
public:
property double Velocity {
	double get ();
}
```

# Remarks
In one section, all section members have same velocity. Default unit is Feet per second. For Duct, unit type is UT_HVAC_Velocity. For Pipe, unit type is UT_Piping_Velocity
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace